{"format": "graph-model", "generatedBy": "2.18.0", "convertedBy": "TensorFlow.js Converter v4.22.0", "signature": {"inputs": {"z": {"name": "z:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "2"}]}}}, "outputs": {"output_0": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "224"}, {"size": "224"}, {"size": "4"}]}}}}, "modelTopology": {"node": [{"name": "StatefulPartitionedCall/conv2d_transpose_41/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/conv2d_transpose_41/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/conv2d_transpose_41/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/conv2d_transpose_41/stack/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/conv2d_transpose_41/stack/2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/conv2d_transpose_41/stack/3", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/conv2d_transpose_41/conv2d_transpose/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "4"}, {"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/conv2d_transpose_40/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/conv2d_transpose_40/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/conv2d_transpose_40/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/conv2d_transpose_40/stack/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/conv2d_transpose_40/stack/2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/conv2d_transpose_40/stack/3", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/conv2d_transpose_40/conv2d_transpose/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "16"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/conv2d_transpose_39/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/conv2d_transpose_39/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/conv2d_transpose_39/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/conv2d_transpose_39/stack/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/conv2d_transpose_39/stack/2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/conv2d_transpose_39/stack/3", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/conv2d_transpose_39/conv2d_transpose/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "32"}, {"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/dense_55/MatMul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "2"}, {"size": "50176"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/dense_55/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "50176"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/reshape_13/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/reshape_13/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/reshape_13/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/reshape_13/Reshape/shape/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/reshape_13/Reshape/shape/2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/reshape_13/Reshape/shape/3", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/conv2d_transpose_39/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/conv2d_transpose_40/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/conv2d_transpose_41/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "z", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "2"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/dense_55/Relu", "op": "_FusedMatMul", "input": ["z", "StatefulPartitionedCall/dense_55/MatMul/ReadVariableOp", "StatefulPartitionedCall/dense_55/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "transpose_b": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "leakyrelu_alpha": {"f": 0.2}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/reshape_13/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/dense_55/Relu"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_SHAPE_TENSOR", "args": [{"typeId": "TFT_INT32"}]}]}}, {"name": "StatefulPartitionedCall/reshape_13/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/reshape_13/Shape", "StatefulPartitionedCall/reshape_13/strided_slice/stack", "StatefulPartitionedCall/reshape_13/strided_slice/stack_1", "StatefulPartitionedCall/reshape_13/strided_slice/stack_2"], "attr": {"shrink_axis_mask": {"i": "1"}, "new_axis_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "begin_mask": {"i": "0"}, "end_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "ellipsis_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/reshape_13/Reshape/shape", "op": "Pack", "input": ["StatefulPartitionedCall/reshape_13/strided_slice", "StatefulPartitionedCall/reshape_13/Reshape/shape/1", "StatefulPartitionedCall/reshape_13/Reshape/shape/2", "StatefulPartitionedCall/reshape_13/Reshape/shape/3"], "attr": {"N": {"i": "4"}, "axis": {"i": "0"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/reshape_13/Reshape", "op": "Reshape", "input": ["StatefulPartitionedCall/dense_55/Relu", "StatefulPartitionedCall/reshape_13/Reshape/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/conv2d_transpose_39/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/reshape_13/Reshape"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_SHAPE_TENSOR", "args": [{"typeId": "TFT_INT32"}]}]}}, {"name": "StatefulPartitionedCall/conv2d_transpose_39/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/conv2d_transpose_39/Shape", "StatefulPartitionedCall/conv2d_transpose_39/strided_slice/stack", "StatefulPartitionedCall/conv2d_transpose_39/strided_slice/stack_1", "StatefulPartitionedCall/conv2d_transpose_39/strided_slice/stack_2"], "attr": {"shrink_axis_mask": {"i": "1"}, "new_axis_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "begin_mask": {"i": "0"}, "end_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "ellipsis_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/conv2d_transpose_39/stack", "op": "Pack", "input": ["StatefulPartitionedCall/conv2d_transpose_39/strided_slice", "StatefulPartitionedCall/conv2d_transpose_39/stack/1", "StatefulPartitionedCall/conv2d_transpose_39/stack/2", "StatefulPartitionedCall/conv2d_transpose_39/stack/3"], "attr": {"N": {"i": "4"}, "axis": {"i": "0"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/conv2d_transpose_39/conv2d_transpose", "op": "Conv2DBackpropInput", "input": ["StatefulPartitionedCall/conv2d_transpose_39/stack", "StatefulPartitionedCall/conv2d_transpose_39/conv2d_transpose/ReadVariableOp", "StatefulPartitionedCall/reshape_13/Reshape"], "attr": {"padding": {"s": "U0FNRQ=="}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/conv2d_transpose_39/BiasAdd", "op": "BiasAdd", "input": ["StatefulPartitionedCall/conv2d_transpose_39/conv2d_transpose", "StatefulPartitionedCall/conv2d_transpose_39/BiasAdd/ReadVariableOp"], "attr": {"data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/conv2d_transpose_39/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/conv2d_transpose_39/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/conv2d_transpose_40/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/conv2d_transpose_39/Relu"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_SHAPE_TENSOR", "args": [{"typeId": "TFT_INT32"}]}]}}, {"name": "StatefulPartitionedCall/conv2d_transpose_40/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/conv2d_transpose_40/Shape", "StatefulPartitionedCall/conv2d_transpose_40/strided_slice/stack", "StatefulPartitionedCall/conv2d_transpose_40/strided_slice/stack_1", "StatefulPartitionedCall/conv2d_transpose_40/strided_slice/stack_2"], "attr": {"shrink_axis_mask": {"i": "1"}, "new_axis_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "begin_mask": {"i": "0"}, "end_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "ellipsis_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/conv2d_transpose_40/stack", "op": "Pack", "input": ["StatefulPartitionedCall/conv2d_transpose_40/strided_slice", "StatefulPartitionedCall/conv2d_transpose_40/stack/1", "StatefulPartitionedCall/conv2d_transpose_40/stack/2", "StatefulPartitionedCall/conv2d_transpose_40/stack/3"], "attr": {"N": {"i": "4"}, "axis": {"i": "0"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/conv2d_transpose_40/conv2d_transpose", "op": "Conv2DBackpropInput", "input": ["StatefulPartitionedCall/conv2d_transpose_40/stack", "StatefulPartitionedCall/conv2d_transpose_40/conv2d_transpose/ReadVariableOp", "StatefulPartitionedCall/conv2d_transpose_39/Relu"], "attr": {"padding": {"s": "U0FNRQ=="}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/conv2d_transpose_40/BiasAdd", "op": "BiasAdd", "input": ["StatefulPartitionedCall/conv2d_transpose_40/conv2d_transpose", "StatefulPartitionedCall/conv2d_transpose_40/BiasAdd/ReadVariableOp"], "attr": {"data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/conv2d_transpose_40/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/conv2d_transpose_40/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/conv2d_transpose_41/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/conv2d_transpose_40/Relu"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_SHAPE_TENSOR", "args": [{"typeId": "TFT_INT32"}]}]}}, {"name": "StatefulPartitionedCall/conv2d_transpose_41/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/conv2d_transpose_41/Shape", "StatefulPartitionedCall/conv2d_transpose_41/strided_slice/stack", "StatefulPartitionedCall/conv2d_transpose_41/strided_slice/stack_1", "StatefulPartitionedCall/conv2d_transpose_41/strided_slice/stack_2"], "attr": {"shrink_axis_mask": {"i": "1"}, "new_axis_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "begin_mask": {"i": "0"}, "end_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "ellipsis_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/conv2d_transpose_41/stack", "op": "Pack", "input": ["StatefulPartitionedCall/conv2d_transpose_41/strided_slice", "StatefulPartitionedCall/conv2d_transpose_41/stack/1", "StatefulPartitionedCall/conv2d_transpose_41/stack/2", "StatefulPartitionedCall/conv2d_transpose_41/stack/3"], "attr": {"N": {"i": "4"}, "axis": {"i": "0"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/conv2d_transpose_41/conv2d_transpose", "op": "Conv2DBackpropInput", "input": ["StatefulPartitionedCall/conv2d_transpose_41/stack", "StatefulPartitionedCall/conv2d_transpose_41/conv2d_transpose/ReadVariableOp", "StatefulPartitionedCall/conv2d_transpose_40/Relu"], "attr": {"padding": {"s": "U0FNRQ=="}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/conv2d_transpose_41/BiasAdd", "op": "BiasAdd", "input": ["StatefulPartitionedCall/conv2d_transpose_41/conv2d_transpose", "StatefulPartitionedCall/conv2d_transpose_41/BiasAdd/ReadVariableOp"], "attr": {"data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/conv2d_transpose_41/Sigmoid", "op": "Sigmoid", "input": ["StatefulPartitionedCall/conv2d_transpose_41/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Identity", "op": "Identity", "input": ["StatefulPartitionedCall/conv2d_transpose_41/Sigmoid"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {}, "versions": {"producer": 1994}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "StatefulPartitionedCall/conv2d_transpose_41/strided_slice/stack", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/conv2d_transpose_41/strided_slice/stack_1", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/conv2d_transpose_41/strided_slice/stack_2", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/conv2d_transpose_41/stack/1", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/conv2d_transpose_41/stack/2", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/conv2d_transpose_41/stack/3", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/conv2d_transpose_41/conv2d_transpose/ReadVariableOp", "shape": [3, 3, 4, 16], "dtype": "float32"}, {"name": "StatefulPartitionedCall/conv2d_transpose_40/strided_slice/stack", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/conv2d_transpose_40/strided_slice/stack_1", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/conv2d_transpose_40/strided_slice/stack_2", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/conv2d_transpose_40/stack/1", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/conv2d_transpose_40/stack/2", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/conv2d_transpose_40/stack/3", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/conv2d_transpose_40/conv2d_transpose/ReadVariableOp", "shape": [3, 3, 16, 32], "dtype": "float32"}, {"name": "StatefulPartitionedCall/conv2d_transpose_39/strided_slice/stack", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/conv2d_transpose_39/strided_slice/stack_1", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/conv2d_transpose_39/strided_slice/stack_2", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/conv2d_transpose_39/stack/1", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/conv2d_transpose_39/stack/2", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/conv2d_transpose_39/stack/3", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/conv2d_transpose_39/conv2d_transpose/ReadVariableOp", "shape": [3, 3, 32, 16], "dtype": "float32"}, {"name": "StatefulPartitionedCall/dense_55/MatMul/ReadVariableOp", "shape": [2, 50176], "dtype": "float32"}, {"name": "StatefulPartitionedCall/dense_55/BiasAdd/ReadVariableOp", "shape": [50176], "dtype": "float32"}, {"name": "StatefulPartitionedCall/reshape_13/strided_slice/stack", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/reshape_13/strided_slice/stack_1", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/reshape_13/strided_slice/stack_2", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/reshape_13/Reshape/shape/1", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/reshape_13/Reshape/shape/2", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/reshape_13/Reshape/shape/3", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/conv2d_transpose_39/BiasAdd/ReadVariableOp", "shape": [32], "dtype": "float32"}, {"name": "StatefulPartitionedCall/conv2d_transpose_40/BiasAdd/ReadVariableOp", "shape": [16], "dtype": "float32"}, {"name": "StatefulPartitionedCall/conv2d_transpose_41/BiasAdd/ReadVariableOp", "shape": [4], "dtype": "float32"}]}]}